_org_posts/_posts/2021-10-15-boj-11723.org
#+HTML: ---
#+HTML: title: BOJ 11723 집합
#+HTML: tags: STL bitest
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 11723 집합
- STL bitset을 연습할 수 있는 문제
- 20bit이므로 uint를 이용해서 풀어도 됨

** 접근하기
- STL bitset으로 20bit의 길이를 잡고, 풀이 
** 코드 : STL bitset을 이용한 풀이
#+BEGIN_SRC cpp
#include <iostream>
#include <cstdio>
#include <bitset>
using namespace std;

int main(int argc, char* argv[])
{
    //freopen("input.txt", "r", stdin);
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int N;
    cin >> N;
    bitset<20> s;
    s.reset();
    for(int i=0;i<N;i++) {
        string cmd;
        cin >> cmd;
    
        int idx;
        if (cmd == "add") {
        cin >> idx;
        s.set(idx-1, true);
        } else if( cmd == "check") {
            cin >> idx;
            if (s.test(idx-1)) {
                cout << 1 << "\n"; // endl을 쓰면 시간초과
            } else {
                cout << 0 << "\n";
            }
        } else if (cmd == "remove") {
            cin >> idx;
            s.set(idx-1, 0);
        } else if (cmd == "toggle") {
            cin >> idx;
            s.flip(idx-1);
        } else if (cmd == "all") {
            s.set();
        } else if (cmd == "empty") {
            s.reset();
        }
    }
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/11723
