_posts/2021-10-15-boj-11723.html
---
title: BOJ 11723 집합
tags: STL bitest
---

<div id="outline-container-orgc3f4f04" class="outline-2">
<h2 id="orgc3f4f04">BOJ 11723 집합</h2>
<div class="outline-text-2" id="text-orgc3f4f04">
<ul class="org-ul">
<li>STL bitset을 연습할 수 있는 문제</li>
<li>20bit이므로 uint를 이용해서 풀어도 됨</li>
</ul>
</div>
</div>

<div id="outline-container-org401d0b6" class="outline-2">
<h2 id="org401d0b6">접근하기</h2>
<div class="outline-text-2" id="text-org401d0b6">
<ul class="org-ul">
<li>STL bitset으로 20bit의 길이를 잡고, 풀이</li>
</ul>
</div>
</div>
<div id="outline-container-org7a5465b" class="outline-2">
<h2 id="org7a5465b">코드 : STL bitset을 이용한 풀이</h2>
<div class="outline-text-2" id="text-org7a5465b">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bitset&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #888a85;">//</span><span style="color: #888a85;">freopen("input.txt", "r", stdin);</span>
    <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>);
    cin.tie(<span style="color: #8ae234;">NULL</span>);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
    cin &gt;&gt; N;
    <span style="color: #8ae234; font-weight: bold;">bitset</span>&lt;20&gt; <span style="color: #ff6347;">s</span>;
    s.reset();
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">cmd</span>;
        cin &gt;&gt; cmd;

        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> (cmd == <span style="color: #ad7fa8; font-style: italic;">"add"</span>) {
        cin &gt;&gt; idx;
        s.set(idx-1, <span style="color: #8ae234;">true</span>);
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span>( cmd == <span style="color: #ad7fa8; font-style: italic;">"check"</span>) {
            cin &gt;&gt; idx;
            <span style="color: #729fcf; font-weight: bold;">if</span> (s.test(idx-1)) {
                cout &lt;&lt; 1 &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"\n"</span>; <span style="color: #888a85;">// </span><span style="color: #888a85;">endl&#51012; &#50416;&#47732; &#49884;&#44036;&#52488;&#44284;</span>
            } <span style="color: #729fcf; font-weight: bold;">else</span> {
                cout &lt;&lt; 0 &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"\n"</span>;
            }
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (cmd == <span style="color: #ad7fa8; font-style: italic;">"remove"</span>) {
            cin &gt;&gt; idx;
            s.set(idx-1, 0);
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (cmd == <span style="color: #ad7fa8; font-style: italic;">"toggle"</span>) {
            cin &gt;&gt; idx;
            s.flip(idx-1);
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (cmd == <span style="color: #ad7fa8; font-style: italic;">"all"</span>) {
            s.set();
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (cmd == <span style="color: #ad7fa8; font-style: italic;">"empty"</span>) {
            s.reset();
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3746a65" class="outline-2">
<h2 id="org3746a65">문제 링크</h2>
<div class="outline-text-2" id="text-org3746a65">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11723">https://www.acmicpc.net/problem/11723</a></li>
</ul>
</div>
</div>
